{
  "backend/main.mo": "Empty Motoko actor stub with no methods.",
  "feature_evidence.json": "Feature evidence report containing an empty features list.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind base stylesheet defining extensive OKLCH color tokens for light/dark themes and global styles.",
  "frontend/index.html": "HTML entry point loading root div and bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app managing navigation, cart, orders, filtering, favorites, hero image preference, and merged product catalog.",
  "frontend/src/components/AddProductDialog.tsx": "Dialog component allowing users to add custom products with validation for fields and image URLs.",
  "frontend/src/components/CartView.tsx": "Cart page displaying items with quantity controls, removal actions, subtotal calculation, and empty state.",
  "frontend/src/components/CheckoutView.tsx": "Checkout form collecting shipping and payment details, validating inputs, calculating subtotal, and simulating order submission.",
  "frontend/src/components/FavoritesView.tsx": "Displays the user's favorited products with options to view details or remove items, and shows an empty-state message when no favorites exist.",
  "frontend/src/components/OrderConfirmationView.tsx": "Shows an order confirmation page with order ID, item list, subtotal, and a button to continue shopping.",
  "frontend/src/components/OrderHistoryView.tsx": "Renders a list of past orders with order details and items, including an empty-state view if no orders exist.",
  "frontend/src/components/ProductDetails.tsx": "Displays detailed product information with an image gallery, like/favorite/share controls, and add-to-cart handling, with fallbacks for missing product data.",
  "frontend/src/components/ProductImageLightbox.tsx": "Provides a modal lightbox for viewing product images with keyboard navigation and next/previous controls.",
  "frontend/src/components/ProductList.tsx": "Renders a product grid with filters, search, price range inputs, and actions to view, like, favorite, share, or add products.",
  "frontend/src/components/SportsShopHeader.tsx": "Header component with navigation buttons for home, favorites, orders, and cart, showing counts and using UI icons.",
  "frontend/src/data/products.ts": "Defines the Product interface and provides a seeded list of sports products with prices and images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useHeroImagePreference.ts": "Manages hero image selection persisted in localStorage with automatic loading and saving.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and stored identity restoration.",
  "frontend/src/hooks/useProductReactions.ts": "Tracks likes and favorites for products using localStorage and exposes toggle and query helpers.",
  "frontend/src/hooks/useUserAddedProducts.ts": "Handles user-added products with persistent storage, merging them with seeded products and generating unique IDs.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light/dark themes and global styling.",
  "frontend/src/lib/orders.ts": "Builds and submits order requests to the backend using cart items and customer info.",
  "frontend/src/lib/productShare.ts": "Generates shareable product links and shares them via Web Share API or clipboard fallback.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, identity provider, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, custom theme extensions, colors, animations, and plugins.",
  "project_state.json": "Stores the project’s current state, requirements, features, and architectural notes for the Sports Shop web app."
}