{
  "backend/main.mo": "Defines product, cart, order, and user profile types and implements order creation, retrieval, and profile management with access control checks.",
  "backend/migration.mo": "Stub migration module exporting a no‑op run function.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles and functionality.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark themes and global styling tokens.",
  "frontend/index.html": "HTML entry point setting page metadata and mounting the root React application.",
  "frontend/src/App.tsx": "Main React app managing navigation, cart logic, product filtering, preferences, reactions, and integrating backend-backed orders.",
  "frontend/src/components/AddProductDialog.tsx": "Dialog component allowing users to create custom products with validation for fields and image URLs.",
  "frontend/src/components/CartView.tsx": "Displays cart items with quantity controls, subtotal calculation, and empty-cart fallback.",
  "frontend/src/components/CheckoutView.tsx": "Handles checkout form, payment input formatting, validation, and order submission.",
  "frontend/src/components/FavoritesView.tsx": "Shows favorited products with options to view details or remove favorites, plus empty-state handling.",
  "frontend/src/components/OrderConfirmationView.tsx": "Displays order confirmation details including items, subtotal, and a continue-shopping button.",
  "frontend/src/components/OrderHistoryView.tsx": "Fetches and displays user order history with loading, error, and empty states.",
  "frontend/src/components/ProductDetails.tsx": "Shows detailed product info with image gallery, actions for cart, likes, favorites, and sharing.",
  "frontend/src/components/ProductImageLightbox.tsx": "Lightbox modal for viewing product images with keyboard navigation and scroll locking.",
  "frontend/src/components/ProductList.tsx": "Product list with search and price filters plus actions like view, add, like, favorite, and share.",
  "frontend/src/components/SportsShopHeader.tsx": "Sticky shop header with navigation to home, favorites, orders, and cart with counts.",
  "frontend/src/data/products.ts": "Static seeded product catalog defining product interface and sample items with images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity with auto‑refresh on identity changes.",
  "frontend/src/hooks/useHeroImagePreference.ts": "Stores and retrieves the selected hero image option in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context managing Internet Identity login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useOrders.ts": "Hooks for fetching user orders and creating new orders via the backend actor.",
  "frontend/src/hooks/useProductReactions.ts": "Manages localStorage‑backed like and favorite reactions for products.",
  "frontend/src/hooks/useUserAddedProducts.ts": "React hook managing user-added products with localStorage persistence and unique ID generation, merging them with seeded products.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark theme CSS variables and global layout rules.",
  "frontend/src/lib/orders.ts": "Converts cart items to backend format, computes totals, and submits orders through the backend actor.",
  "frontend/src/lib/productShare.ts": "Builds shareable product URLs and uses Web Share API or clipboard as fallback to share product details.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins for typography, animations, and container queries.",
  "project_state.json": "JSON metadata describing the project state, implemented features, and architectural notes."
}