{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report describing added product catalog items and related files, components, and tests.",
  "frontend-file-summaries.txt": "Pre-generated summaries for multiple frontend files outlining components, styles, data, and app logic.",
  "frontend/index.css": "Defines global Tailwind styles and OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app with title 'Vikash Sports'.",
  "frontend/src/App.tsx": "Main React app managing navigation, cart state, product selection, checkout, and order history.",
  "frontend/src/components/CartView.tsx": "Displays cart items with quantity controls, pricing, and navigation to checkout.",
  "frontend/src/components/CheckoutView.tsx": "Checkout form capturing customer info and generating a mock order ID before confirming the order.",
  "frontend/src/components/OrderConfirmationView.tsx": "Shows order confirmation details including items, subtotal, and a continue shopping action.",
  "frontend/src/components/OrderHistoryView.tsx": "Renders past orders with item details, subtotal, and navigation back to products, showing an empty state when no orders exist.",
  "frontend/src/components/ProductDetails.tsx": "Displays detailed product info with an image gallery and add‑to‑cart button, including a fallback view when a product is missing.",
  "frontend/src/components/ProductList.tsx": "Shows a grid of product cards with images, price, description, and actions to view details or add to cart.",
  "frontend/src/components/SportsShopHeader.tsx": "Provides a sticky header with navigation to home, orders, and cart, showing the current cart count.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports a static list of sample sports products with images and descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity, invalidating related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and hooks for Internet Identity login, identity persistence, and status tracking using AuthClient.",
  "frontend/src/index.css": "Defines Tailwind layers and sets extensive OKLCH-based CSS variables for light and dark themes, applying global border and body styles.",
  "frontend/src/lib/orders.ts": "Converts cart and customer form data into an order request and sends it to the backend to create an order, returning the order ID.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, animations, and plugins, mapping CSS variables to theme values.",
  "project_state.json": "Stores project metadata, feature list, requirements mapping, and current build state info."
}