{
  "backend/main.mo": "Defines an empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report describing branding updates to show \"Vikash Sports\" across the app and listing affected files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including components, styles, and configuration.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens, theme variables, and global styles for light and dark modes.",
  "frontend/index.html": "HTML entry point setting up the root element and page title \"Vikash Sports\".",
  "frontend/src/App.tsx": "Main React component handling cart state, product navigation, hero section, and page layout including header and footer.",
  "frontend/src/components/ProductDetails.tsx": "Displays detailed product information with image, price, description, add‑to‑cart action, and a not‑found fallback.",
  "frontend/src/components/ProductList.tsx": "Renders a responsive grid of product cards with view‑details and add‑to‑cart actions.",
  "frontend/src/components/SportsShopHeader.tsx": "Header showing the site title \"Vikash Sports\" and a cart count indicator with an icon.",
  "frontend/src/data/products.ts": "Defines a Product interface and exports a seeded list of five sports products.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context and hooks, handling login, logout, and identity persistence.",
  "frontend/src/index.css": "Defines Tailwind layers and a comprehensive set of CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, radius, shadows, animations, and loads plugins for typography, container queries, and animations.",
  "project_state.json": "Contains project metadata, feature definitions, and requirements for a Sports Shop web app."
}